In [1]:
# print("hello Gerald and World")

hello Gerald and World

In [1]:
#print("hello Arsalon and World")

hello Arsalon and World

In [1]:
import pandas as pd

In [2]:
banksdf = pd.read_csv("C:/Users/User/csc5610/finalProj_jira/ai_tools_final_project/Banks.csv")
# pandas csv parameters https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
# custom delimiter df = pd.read_csv('Book1.csv', sep=';')
# read only the first 3 columns

In [3]:
banksdf.describe()

               star          like
count  19271.000000  17769.000000
mean       1.432567     11.109291
std        1.151793      8.091683
min        1.000000      2.000000
25%        1.000000      6.000000
50%        1.000000      9.000000
75%        1.000000     14.000000
max        5.000000    248.000000

In [4]:
banksdf.head()

,author,date,location,bank,star,text,like
0,Kyle,31.08.2023,"Magnolia, TX",merrick_bank,5,Very easy to use to view statements and make o...,NaN
1,Julicia,23.08.2023,"Columbus, GA",merrick_bank,5,Merrick Bank has always been good to me for bu...,NaN
2,Karen,2.06.2023,"Marrero, LA",merrick_bank,4,Times are tough for everyone and I have worked...,3.0
3,Brent,29.03.2023,"Moultrie, GA",merrick_bank,5,I can not asked for a better Credit Card Compa...,3.0
4,Sharon,23.11.2022,"Burnham, IL",merrick_bank,5,Updated on 02/10/2023: I was happy to sign for...,3.0

In [5]:
banksdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19271 entries, 0 to 19270
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   author    19269 non-null  object
 1   date      19271 non-null  object
 2   location  19271 non-null  object
 3   bank      19271 non-null  object
 4   star      19271 non-null  int64
 5   text      19181 non-null  object
 6   like      17769 non-null  float64
dtypes: float64(1), int64(1), object(5)
memory usage: 1.0+ MB

In [6]:
banksdf.tail()

,author,date,location,bank,star,text,like
19266,J.,30.01.2017,"Salem, OR",tcf_bank,1,Paid my 1st payment on time. They sent me a la...,11.0
19267,Destiny,28.01.2017,"Andover, MN",tcf_bank,1,I have banked with TCF for about 4 years now a...,12.0
19268,Sean,25.01.2017,"Bothell, WA",tcf_bank,1,Most inconvenient bank ever. As a business own...,10.0
19269,Edgar,12.01.2017,"Minneapolis, MI",tcf_bank,1,Well I've been with TCF Bank for 3 plus years ...,12.0
19270,edward,2.01.2017,"Suite B, MI",tcf_bank,1,Deposited $800 3 days ago by certified check a...,10.0

#### Clean up data types

In [7]:
banksdf.dtypes  #check to change object to category for the below features

author       object
date         object
location     object
bank         object
star          int64
text         object
like        float64
dtype: object

In [18]:
banksdf["author"] = banksdf["author"].astype("category")

In [19]:
banksdf["location"] = banksdf["location"].astype("category")

In [20]:
banksdf["bank"] = banksdf["bank"].astype("category")

In [21]:
banksdf["text"] = banksdf["text"].astype("category")

In [22]:
banksdf["date"] = banksdf["date"].astype("category")

In [23]:
banksdf.dtypes

author      category
date        category
location    category
bank        category
star           int64
text        category
like         float64
dtype: object

#### Clean up NAN valuess

In [8]:
banksdf.isna().sum()  #check the NANs  ?change like NANs to 0, drop the 90 text NAN, change 2 author NAN to "unknown"

author         2
date           0
location       0
bank           0
star           0
text          90
like        1502
dtype: int64

In [ ]:
# since text data is important any observation with no text should be dropped but those observations have stars and likes
# ocnsider analyzing the NaN text based on stars and likes

In [24]:
banksdf.loc[banksdf['text'].isna()]

       author        date           location          bank  star text  like
610     Danny  17.05.2019       Wetumpka, AL  merrick_bank     3  NaN   5.0
1195     Alex  23.04.2021      London, Other          hsbc     1  NaN   7.0
1198       Al  17.12.2020       Dubai, Other          hsbc     1  NaN  10.0
1592   Robert  23.12.2018   Gaithersburg, MD      bbt_bank     1  NaN  20.0
1669      Dan   3.04.2018         Bomley, KY      bbt_bank     1  NaN  10.0
...       ...         ...                ...           ...   ...  ...   ...
17803     Tom   5.05.2022          Alton, IL    credit_one     1  NaN   5.0
18047   Marco  28.04.2020        Wahiawa, HI    credit_one     1  NaN  28.0
18211    Sean  11.05.2019         Talent, OR    credit_one     1  NaN   3.0
18416  Robert   7.08.2018  San Francisco, CA    credit_one     1  NaN  13.0
18521       k  10.02.2018      Charlotte, NC    credit_one     1  NaN   8.0

[90 rows x 7 columns]

In [29]:
like_nans = banksdf[banksdf['like'].isna()]  #get the list of rows with like == NaN

In [30]:
len(like_nans)

1502

In [14]:
banksdf.loc[banksdf['author'].isna()]

,author,date,location,bank,star,text,like
2586,NaN,9.09.2020,"Seattle, WA",us_bank,1,We attempted to refinance our house using US B...,17.0
12779,NaN,8.12.2021,"Clinton Township, MI",huntington-bank,1,"Rude, doesn't care. Wants me to keep coming ba...",9.0

In [15]:
#change the above two observations author names to 'Anonymous'
banksdf.update(banksdf.iloc[[2586]].fillna('Anonymous'))
banksdf.update(banksdf.iloc[[12779]].fillna('Anonymous'))

In [17]:
banksdf.loc[banksdf['author'].isna()]

Empty DataFrame
Columns: [author, date, location, bank, star, text, like]
Index: []

In [25]:
# for the observations with NaN for likes change the NaN to 0
#save indexes of these rows in a list, then use the list to update the rows